/*---------------------------------------------------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/*---------------------------------------------------------------------*/

#include "STC32G_Timer.h"
#include "STC32G_UART.h"
#include "STC32G_NVIC.h"

#include "ds_sensor.h"
//========================================================================
// 函数: Timer0_ISR_Handler
// 描述: Timer0中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
// void Timer0_ISR_Handler(void) interrupt TMR0_VECTOR // 进中断时已经清除标志
//{

//}

//========================================================================
// 函数: Timer1_ISR_Handler
// 描述: Timer1中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer1_ISR_Handler(void) interrupt TMR1_VECTOR // 进中断时已经清除标志
{
    // TODO: 在此处添加用户代码
    P66 = ~P66;
}

//========================================================================
// 函数: Timer2_ISR_Handler
// 描述: Timer2中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer2_ISR_Handler(void) interrupt TMR2_VECTOR // 进中断时已经清除标志
{
    // TODO: 在此处添加用户代码
    P65 = ~P65;
}

//========================================================================
// 函数: Timer3_ISR_Handler
// 描述: Timer3中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer3_ISR_Handler(void) interrupt TMR3_VECTOR // 进中断时已经清除标志
{
#if DS_SENSOR == 161
#include "ds161_co_meter.h"
    static u16 tick = 0;
    tick++;
    if (tick == 100)
    {
        tick = 0;
        sys_tick++;
    }
#endif
    // TODO: 在此处添加用户代码
    P64 = ~P64;
}

//========================================================================
// 函数: Timer4_ISR_Handler
// 描述: Timer4中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer4_ISR_Handler(void) interrupt TMR4_VECTOR // 进中断时已经清除标志
{
    // TODO: 在此处添加用户代码
    P63 = ~P63;
}
