#include	"STC32G_Delay.h"

//========================================================================
// 函数: void delay_us(unsigned int ms)
// 描述: 延时函数。
// 参数: us,要延时的us数, 这里只支持1~65535us. 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期: 2025-5-16
// 备注: 
//========================================================================
void delay_us(u16 us)
{
    u16 i;
    do{
        i = MAIN_Fosc / 6153840;
        while(--i);
    }while(--us);
}

//========================================================================
// 函数: void delay_ms(unsigned int ms)
// 描述: 延时函数。
// 参数: ms,要延时的ms数, 这里只支持1~65535ms. 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期: 2021-3-9
// 备注: 
//========================================================================
void delay_ms(u16 ms)
{
    while (ms--)
    {
        delay_us(1000);
    }
}



